program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1436.100.10"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<int32, []> var_56 = const()[name = tensor<string, []>("op_56"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_64 = const()[name = tensor<string, []>("op_64"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_66 = const()[name = tensor<string, []>("op_66"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_68_pad_type_0 = const()[name = tensor<string, []>("op_68_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_68_pad_0 = const()[name = tensor<string, []>("op_68_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1024, 80, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [1024, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1024]> bias_3_to_fp16 = const()[name = tensor<string, []>("bias_3_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(491648)))];
            tensor<fp16, [1, 80, 3000]> cast_727 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data);
            tensor<fp16, [1, 1024, 3000]> var_68_cast = conv(bias = bias_3_to_fp16, dilations = var_66, groups = var_56, pad = var_68_pad_0, pad_type = var_68_pad_type_0, strides = var_64, weight = weight_3_to_fp16, x = cast_727);
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1024, 3000]> input_1_cast = gelu(mode = input_1_mode_0, x = var_68_cast);
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_81 = const()[name = tensor<string, []>("op_81"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_85_pad_type_0 = const()[name = tensor<string, []>("op_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_85_pad_0 = const()[name = tensor<string, []>("op_85_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1024, 1024, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [1024, 1024, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(493760)))];
            tensor<fp16, [1024]> bias_7_to_fp16 = const()[name = tensor<string, []>("bias_7_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6785280)))];
            tensor<fp16, [1, 1024, 1500]> var_85_cast = conv(bias = bias_7_to_fp16, dilations = var_83, groups = var_72, pad = var_85_pad_0, pad_type = var_85_pad_type_0, strides = var_81, weight = weight_7_to_fp16, x = input_1_cast);
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1024, 1500]> x_3_cast = gelu(mode = x_3_mode_0, x = var_85_cast);
            tensor<int32, [3]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1500, 1024]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [1500, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6787392)))];
            tensor<fp16, [1, 1500, 1024]> transpose_192 = transpose(perm = var_90, x = x_3_cast);
            tensor<fp16, [1, 1500, 1024]> var_93_cast = add(x = transpose_192, y = positional_embedding_to_fp16);
            tensor<int32, []> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_123_axes_0 = const()[name = tensor<string, []>("op_123_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_0_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9859456)))];
            tensor<fp16, [1024]> blocks_0_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9861568)))];
            tensor<fp16, []> var_112_to_fp16 = const()[name = tensor<string, []>("op_112_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1024]> var_123_cast = layer_norm(axes = var_123_axes_0, beta = blocks_0_attn_ln_bias_to_fp16, epsilon = var_112_to_fp16, gamma = blocks_0_attn_ln_weight_to_fp16, x = var_93_cast);
            tensor<fp16, [1024, 1024]> var_134_to_fp16 = const()[name = tensor<string, []>("op_134_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9863680)))];
            tensor<fp16, [1024]> var_135_to_fp16 = const()[name = tensor<string, []>("op_135_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11960896)))];
            tensor<fp16, [1, 1500, 1024]> q_1_cast = linear(bias = var_135_to_fp16, weight = var_134_to_fp16, x = var_123_cast);
            tensor<fp16, [1024, 1024]> var_138_to_fp16 = const()[name = tensor<string, []>("op_138_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11963008)))];
            tensor<fp16, [1024]> k_1_bias_0_to_fp16 = const()[name = tensor<string, []>("k_1_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14060224)))];
            tensor<fp16, [1, 1500, 1024]> k_1_cast = linear(bias = k_1_bias_0_to_fp16, weight = var_138_to_fp16, x = var_123_cast);
            tensor<fp16, [1024, 1024]> var_142_to_fp16 = const()[name = tensor<string, []>("op_142_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14062336)))];
            tensor<fp16, [1024]> var_143_to_fp16 = const()[name = tensor<string, []>("op_143_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16159552)))];
            tensor<fp16, [1, 1500, 1024]> v_1_cast = linear(bias = var_143_to_fp16, weight = var_142_to_fp16, x = var_123_cast);
            tensor<int32, [4]> var_151 = const()[name = tensor<string, []>("op_151"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_152_cast = reshape(shape = var_151, x = q_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_168_to_fp16 = const()[name = tensor<string, []>("const_168_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> q_3_cast = mul(x = var_152_cast, y = const_168_to_fp16);
            tensor<int32, [4]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_159_cast = reshape(shape = var_158, x = k_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_169_to_fp16 = const()[name = tensor<string, []>("const_169_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> k_3_cast = mul(x = var_159_cast, y = const_169_to_fp16);
            tensor<int32, [4]> var_165 = const()[name = tensor<string, []>("op_165"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_166_cast = reshape(shape = var_165, x = v_1_cast);
            tensor<int32, [4]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_1_transpose_x_0 = const()[name = tensor<string, []>("qk_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_1_transpose_y_0 = const()[name = tensor<string, []>("qk_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 16, 64, 1500]> transpose_189 = transpose(perm = transpose_49_perm_0, x = k_3_cast);
            tensor<fp16, [1, 16, 1500, 64]> transpose_190 = transpose(perm = transpose_48_perm_0, x = q_3_cast);
            tensor<fp16, [1, 16, 1500, 1500]> qk_1_cast = matmul(transpose_x = qk_1_transpose_x_0, transpose_y = qk_1_transpose_y_0, x = transpose_190, y = transpose_189);
            tensor<fp16, [1, 16, 1500, 1500]> var_171_cast = softmax(axis = var_106, x = qk_1_cast);
            tensor<bool, []> var_173_transpose_x_0 = const()[name = tensor<string, []>("op_173_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_173_transpose_y_0 = const()[name = tensor<string, []>("op_173_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 1500, 64]> transpose_191 = transpose(perm = var_167, x = var_166_cast);
            tensor<fp16, [1, 16, 1500, 64]> var_173_cast = matmul(transpose_x = var_173_transpose_x_0, transpose_y = var_173_transpose_y_0, x = var_171_cast, y = transpose_191);
            tensor<int32, [4]> var_174 = const()[name = tensor<string, []>("op_174"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 1500, 1024])];
            tensor<fp16, [1, 1500, 16, 64]> transpose_188 = transpose(perm = var_174, x = var_173_cast);
            tensor<fp16, [1, 1500, 1024]> x_11_cast = reshape(shape = concat_0, x = transpose_188);
            tensor<fp16, [1024, 1024]> var_179_to_fp16 = const()[name = tensor<string, []>("op_179_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16161664)))];
            tensor<fp16, [1024]> var_180_to_fp16 = const()[name = tensor<string, []>("op_180_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18258880)))];
            tensor<fp16, [1, 1500, 1024]> var_181_cast = linear(bias = var_180_to_fp16, weight = var_179_to_fp16, x = x_11_cast);
            tensor<fp16, [1, 1500, 1024]> x_13_cast = add(x = var_93_cast, y = var_181_cast);
            tensor<int32, [1]> var_187_axes_0 = const()[name = tensor<string, []>("op_187_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_0_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18260992)))];
            tensor<fp16, [1024]> blocks_0_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18263104)))];
            tensor<fp16, [1, 1500, 1024]> var_187_cast = layer_norm(axes = var_187_axes_0, beta = blocks_0_mlp_ln_bias_to_fp16, epsilon = var_112_to_fp16, gamma = blocks_0_mlp_ln_weight_to_fp16, x = x_13_cast);
            tensor<fp16, [4096, 1024]> var_196_to_fp16 = const()[name = tensor<string, []>("op_196_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18265216)))];
            tensor<fp16, [4096]> var_197_to_fp16 = const()[name = tensor<string, []>("op_197_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26653888)))];
            tensor<fp16, [1, 1500, 4096]> input_9_cast = linear(bias = var_197_to_fp16, weight = var_196_to_fp16, x = var_187_cast);
            tensor<string, []> x_17_mode_0 = const()[name = tensor<string, []>("x_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 4096]> x_17_cast = gelu(mode = x_17_mode_0, x = input_9_cast);
            tensor<fp16, [1024, 4096]> var_202_to_fp16 = const()[name = tensor<string, []>("op_202_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26662144)))];
            tensor<fp16, [1024]> var_203_to_fp16 = const()[name = tensor<string, []>("op_203_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35050816)))];
            tensor<fp16, [1, 1500, 1024]> var_204_cast = linear(bias = var_203_to_fp16, weight = var_202_to_fp16, x = x_17_cast);
            tensor<fp16, [1, 1500, 1024]> x_19_cast = add(x = x_13_cast, y = var_204_cast);
            tensor<int32, []> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_230_axes_0 = const()[name = tensor<string, []>("op_230_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_1_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35052928)))];
            tensor<fp16, [1024]> blocks_1_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35055040)))];
            tensor<fp16, []> var_219_to_fp16 = const()[name = tensor<string, []>("op_219_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1024]> var_230_cast = layer_norm(axes = var_230_axes_0, beta = blocks_1_attn_ln_bias_to_fp16, epsilon = var_219_to_fp16, gamma = blocks_1_attn_ln_weight_to_fp16, x = x_19_cast);
            tensor<fp16, [1024, 1024]> var_241_to_fp16 = const()[name = tensor<string, []>("op_241_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35057152)))];
            tensor<fp16, [1024]> var_242_to_fp16 = const()[name = tensor<string, []>("op_242_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37154368)))];
            tensor<fp16, [1, 1500, 1024]> q_5_cast = linear(bias = var_242_to_fp16, weight = var_241_to_fp16, x = var_230_cast);
            tensor<fp16, [1024, 1024]> var_245_to_fp16 = const()[name = tensor<string, []>("op_245_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37156480)))];
            tensor<fp16, [1024]> k_5_bias_0_to_fp16 = const()[name = tensor<string, []>("k_5_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39253696)))];
            tensor<fp16, [1, 1500, 1024]> k_5_cast = linear(bias = k_5_bias_0_to_fp16, weight = var_245_to_fp16, x = var_230_cast);
            tensor<fp16, [1024, 1024]> var_249_to_fp16 = const()[name = tensor<string, []>("op_249_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39255808)))];
            tensor<fp16, [1024]> var_250_to_fp16 = const()[name = tensor<string, []>("op_250_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41353024)))];
            tensor<fp16, [1, 1500, 1024]> v_5_cast = linear(bias = var_250_to_fp16, weight = var_249_to_fp16, x = var_230_cast);
            tensor<int32, [4]> var_258 = const()[name = tensor<string, []>("op_258"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_259_cast = reshape(shape = var_258, x = q_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_170_to_fp16 = const()[name = tensor<string, []>("const_170_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> q_7_cast = mul(x = var_259_cast, y = const_170_to_fp16);
            tensor<int32, [4]> var_265 = const()[name = tensor<string, []>("op_265"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_266_cast = reshape(shape = var_265, x = k_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_171_to_fp16 = const()[name = tensor<string, []>("const_171_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> k_7_cast = mul(x = var_266_cast, y = const_171_to_fp16);
            tensor<int32, [4]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_273_cast = reshape(shape = var_272, x = v_5_cast);
            tensor<int32, [4]> var_274 = const()[name = tensor<string, []>("op_274"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_3_transpose_x_0 = const()[name = tensor<string, []>("qk_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_3_transpose_y_0 = const()[name = tensor<string, []>("qk_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 16, 64, 1500]> transpose_185 = transpose(perm = transpose_51_perm_0, x = k_7_cast);
            tensor<fp16, [1, 16, 1500, 64]> transpose_186 = transpose(perm = transpose_50_perm_0, x = q_7_cast);
            tensor<fp16, [1, 16, 1500, 1500]> qk_3_cast = matmul(transpose_x = qk_3_transpose_x_0, transpose_y = qk_3_transpose_y_0, x = transpose_186, y = transpose_185);
            tensor<fp16, [1, 16, 1500, 1500]> var_278_cast = softmax(axis = var_213, x = qk_3_cast);
            tensor<bool, []> var_280_transpose_x_0 = const()[name = tensor<string, []>("op_280_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_280_transpose_y_0 = const()[name = tensor<string, []>("op_280_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 1500, 64]> transpose_187 = transpose(perm = var_274, x = var_273_cast);
            tensor<fp16, [1, 16, 1500, 64]> var_280_cast = matmul(transpose_x = var_280_transpose_x_0, transpose_y = var_280_transpose_y_0, x = var_278_cast, y = transpose_187);
            tensor<int32, [4]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_1 = const()[name = tensor<string, []>("concat_1"), val = tensor<int32, [3]>([1, 1500, 1024])];
            tensor<fp16, [1, 1500, 16, 64]> transpose_184 = transpose(perm = var_281, x = var_280_cast);
            tensor<fp16, [1, 1500, 1024]> x_23_cast = reshape(shape = concat_1, x = transpose_184);
            tensor<fp16, [1024, 1024]> var_286_to_fp16 = const()[name = tensor<string, []>("op_286_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41355136)))];
            tensor<fp16, [1024]> var_287_to_fp16 = const()[name = tensor<string, []>("op_287_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43452352)))];
            tensor<fp16, [1, 1500, 1024]> var_288_cast = linear(bias = var_287_to_fp16, weight = var_286_to_fp16, x = x_23_cast);
            tensor<fp16, [1, 1500, 1024]> x_25_cast = add(x = x_19_cast, y = var_288_cast);
            tensor<int32, [1]> var_294_axes_0 = const()[name = tensor<string, []>("op_294_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_1_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43454464)))];
            tensor<fp16, [1024]> blocks_1_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43456576)))];
            tensor<fp16, [1, 1500, 1024]> var_294_cast = layer_norm(axes = var_294_axes_0, beta = blocks_1_mlp_ln_bias_to_fp16, epsilon = var_219_to_fp16, gamma = blocks_1_mlp_ln_weight_to_fp16, x = x_25_cast);
            tensor<fp16, [4096, 1024]> var_303_to_fp16 = const()[name = tensor<string, []>("op_303_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43458688)))];
            tensor<fp16, [4096]> var_304_to_fp16 = const()[name = tensor<string, []>("op_304_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51847360)))];
            tensor<fp16, [1, 1500, 4096]> input_17_cast = linear(bias = var_304_to_fp16, weight = var_303_to_fp16, x = var_294_cast);
            tensor<string, []> x_29_mode_0 = const()[name = tensor<string, []>("x_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 4096]> x_29_cast = gelu(mode = x_29_mode_0, x = input_17_cast);
            tensor<fp16, [1024, 4096]> var_309_to_fp16 = const()[name = tensor<string, []>("op_309_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51855616)))];
            tensor<fp16, [1024]> var_310_to_fp16 = const()[name = tensor<string, []>("op_310_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60244288)))];
            tensor<fp16, [1, 1500, 1024]> var_311_cast = linear(bias = var_310_to_fp16, weight = var_309_to_fp16, x = x_29_cast);
            tensor<fp16, [1, 1500, 1024]> x_31_cast = add(x = x_25_cast, y = var_311_cast);
            tensor<int32, []> var_320 = const()[name = tensor<string, []>("op_320"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_337_axes_0 = const()[name = tensor<string, []>("op_337_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_2_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60246400)))];
            tensor<fp16, [1024]> blocks_2_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60248512)))];
            tensor<fp16, []> var_326_to_fp16 = const()[name = tensor<string, []>("op_326_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1024]> var_337_cast = layer_norm(axes = var_337_axes_0, beta = blocks_2_attn_ln_bias_to_fp16, epsilon = var_326_to_fp16, gamma = blocks_2_attn_ln_weight_to_fp16, x = x_31_cast);
            tensor<fp16, [1024, 1024]> var_348_to_fp16 = const()[name = tensor<string, []>("op_348_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60250624)))];
            tensor<fp16, [1024]> var_349_to_fp16 = const()[name = tensor<string, []>("op_349_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62347840)))];
            tensor<fp16, [1, 1500, 1024]> q_9_cast = linear(bias = var_349_to_fp16, weight = var_348_to_fp16, x = var_337_cast);
            tensor<fp16, [1024, 1024]> var_352_to_fp16 = const()[name = tensor<string, []>("op_352_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62349952)))];
            tensor<fp16, [1024]> k_9_bias_0_to_fp16 = const()[name = tensor<string, []>("k_9_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64447168)))];
            tensor<fp16, [1, 1500, 1024]> k_9_cast = linear(bias = k_9_bias_0_to_fp16, weight = var_352_to_fp16, x = var_337_cast);
            tensor<fp16, [1024, 1024]> var_356_to_fp16 = const()[name = tensor<string, []>("op_356_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64449280)))];
            tensor<fp16, [1024]> var_357_to_fp16 = const()[name = tensor<string, []>("op_357_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66546496)))];
            tensor<fp16, [1, 1500, 1024]> v_9_cast = linear(bias = var_357_to_fp16, weight = var_356_to_fp16, x = var_337_cast);
            tensor<int32, [4]> var_365 = const()[name = tensor<string, []>("op_365"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_366_cast = reshape(shape = var_365, x = q_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_172_to_fp16 = const()[name = tensor<string, []>("const_172_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> q_11_cast = mul(x = var_366_cast, y = const_172_to_fp16);
            tensor<int32, [4]> var_372 = const()[name = tensor<string, []>("op_372"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_373_cast = reshape(shape = var_372, x = k_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_173_to_fp16 = const()[name = tensor<string, []>("const_173_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> k_11_cast = mul(x = var_373_cast, y = const_173_to_fp16);
            tensor<int32, [4]> var_379 = const()[name = tensor<string, []>("op_379"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_380_cast = reshape(shape = var_379, x = v_9_cast);
            tensor<int32, [4]> var_381 = const()[name = tensor<string, []>("op_381"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_5_transpose_x_0 = const()[name = tensor<string, []>("qk_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_5_transpose_y_0 = const()[name = tensor<string, []>("qk_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 16, 64, 1500]> transpose_181 = transpose(perm = transpose_53_perm_0, x = k_11_cast);
            tensor<fp16, [1, 16, 1500, 64]> transpose_182 = transpose(perm = transpose_52_perm_0, x = q_11_cast);
            tensor<fp16, [1, 16, 1500, 1500]> qk_5_cast = matmul(transpose_x = qk_5_transpose_x_0, transpose_y = qk_5_transpose_y_0, x = transpose_182, y = transpose_181);
            tensor<fp16, [1, 16, 1500, 1500]> var_385_cast = softmax(axis = var_320, x = qk_5_cast);
            tensor<bool, []> var_387_transpose_x_0 = const()[name = tensor<string, []>("op_387_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_387_transpose_y_0 = const()[name = tensor<string, []>("op_387_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 1500, 64]> transpose_183 = transpose(perm = var_381, x = var_380_cast);
            tensor<fp16, [1, 16, 1500, 64]> var_387_cast = matmul(transpose_x = var_387_transpose_x_0, transpose_y = var_387_transpose_y_0, x = var_385_cast, y = transpose_183);
            tensor<int32, [4]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_2 = const()[name = tensor<string, []>("concat_2"), val = tensor<int32, [3]>([1, 1500, 1024])];
            tensor<fp16, [1, 1500, 16, 64]> transpose_180 = transpose(perm = var_388, x = var_387_cast);
            tensor<fp16, [1, 1500, 1024]> x_35_cast = reshape(shape = concat_2, x = transpose_180);
            tensor<fp16, [1024, 1024]> var_393_to_fp16 = const()[name = tensor<string, []>("op_393_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66548608)))];
            tensor<fp16, [1024]> var_394_to_fp16 = const()[name = tensor<string, []>("op_394_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68645824)))];
            tensor<fp16, [1, 1500, 1024]> var_395_cast = linear(bias = var_394_to_fp16, weight = var_393_to_fp16, x = x_35_cast);
            tensor<fp16, [1, 1500, 1024]> x_37_cast = add(x = x_31_cast, y = var_395_cast);
            tensor<int32, [1]> var_401_axes_0 = const()[name = tensor<string, []>("op_401_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_2_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68647936)))];
            tensor<fp16, [1024]> blocks_2_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68650048)))];
            tensor<fp16, [1, 1500, 1024]> var_401_cast = layer_norm(axes = var_401_axes_0, beta = blocks_2_mlp_ln_bias_to_fp16, epsilon = var_326_to_fp16, gamma = blocks_2_mlp_ln_weight_to_fp16, x = x_37_cast);
            tensor<fp16, [4096, 1024]> var_410_to_fp16 = const()[name = tensor<string, []>("op_410_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68652160)))];
            tensor<fp16, [4096]> var_411_to_fp16 = const()[name = tensor<string, []>("op_411_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77040832)))];
            tensor<fp16, [1, 1500, 4096]> input_25_cast = linear(bias = var_411_to_fp16, weight = var_410_to_fp16, x = var_401_cast);
            tensor<string, []> x_41_mode_0 = const()[name = tensor<string, []>("x_41_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 4096]> x_41_cast = gelu(mode = x_41_mode_0, x = input_25_cast);
            tensor<fp16, [1024, 4096]> var_416_to_fp16 = const()[name = tensor<string, []>("op_416_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77049088)))];
            tensor<fp16, [1024]> var_417_to_fp16 = const()[name = tensor<string, []>("op_417_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85437760)))];
            tensor<fp16, [1, 1500, 1024]> var_418_cast = linear(bias = var_417_to_fp16, weight = var_416_to_fp16, x = x_41_cast);
            tensor<fp16, [1, 1500, 1024]> x_43_cast = add(x = x_37_cast, y = var_418_cast);
            tensor<int32, []> var_427 = const()[name = tensor<string, []>("op_427"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_444_axes_0 = const()[name = tensor<string, []>("op_444_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_3_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85439872)))];
            tensor<fp16, [1024]> blocks_3_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85441984)))];
            tensor<fp16, []> var_433_to_fp16 = const()[name = tensor<string, []>("op_433_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1024]> var_444_cast = layer_norm(axes = var_444_axes_0, beta = blocks_3_attn_ln_bias_to_fp16, epsilon = var_433_to_fp16, gamma = blocks_3_attn_ln_weight_to_fp16, x = x_43_cast);
            tensor<fp16, [1024, 1024]> var_455_to_fp16 = const()[name = tensor<string, []>("op_455_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(85444096)))];
            tensor<fp16, [1024]> var_456_to_fp16 = const()[name = tensor<string, []>("op_456_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87541312)))];
            tensor<fp16, [1, 1500, 1024]> q_13_cast = linear(bias = var_456_to_fp16, weight = var_455_to_fp16, x = var_444_cast);
            tensor<fp16, [1024, 1024]> var_459_to_fp16 = const()[name = tensor<string, []>("op_459_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87543424)))];
            tensor<fp16, [1024]> k_13_bias_0_to_fp16 = const()[name = tensor<string, []>("k_13_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89640640)))];
            tensor<fp16, [1, 1500, 1024]> k_13_cast = linear(bias = k_13_bias_0_to_fp16, weight = var_459_to_fp16, x = var_444_cast);
            tensor<fp16, [1024, 1024]> var_463_to_fp16 = const()[name = tensor<string, []>("op_463_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89642752)))];
            tensor<fp16, [1024]> var_464_to_fp16 = const()[name = tensor<string, []>("op_464_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91739968)))];
            tensor<fp16, [1, 1500, 1024]> v_13_cast = linear(bias = var_464_to_fp16, weight = var_463_to_fp16, x = var_444_cast);
            tensor<int32, [4]> var_472 = const()[name = tensor<string, []>("op_472"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_473_cast = reshape(shape = var_472, x = q_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_174_to_fp16 = const()[name = tensor<string, []>("const_174_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> q_15_cast = mul(x = var_473_cast, y = const_174_to_fp16);
            tensor<int32, [4]> var_479 = const()[name = tensor<string, []>("op_479"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_480_cast = reshape(shape = var_479, x = k_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_175_to_fp16 = const()[name = tensor<string, []>("const_175_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> k_15_cast = mul(x = var_480_cast, y = const_175_to_fp16);
            tensor<int32, [4]> var_486 = const()[name = tensor<string, []>("op_486"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_487_cast = reshape(shape = var_486, x = v_13_cast);
            tensor<int32, [4]> var_488 = const()[name = tensor<string, []>("op_488"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_7_transpose_x_0 = const()[name = tensor<string, []>("qk_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_7_transpose_y_0 = const()[name = tensor<string, []>("qk_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = tensor<string, []>("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = tensor<string, []>("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 16, 64, 1500]> transpose_177 = transpose(perm = transpose_55_perm_0, x = k_15_cast);
            tensor<fp16, [1, 16, 1500, 64]> transpose_178 = transpose(perm = transpose_54_perm_0, x = q_15_cast);
            tensor<fp16, [1, 16, 1500, 1500]> qk_7_cast = matmul(transpose_x = qk_7_transpose_x_0, transpose_y = qk_7_transpose_y_0, x = transpose_178, y = transpose_177);
            tensor<fp16, [1, 16, 1500, 1500]> var_492_cast = softmax(axis = var_427, x = qk_7_cast);
            tensor<bool, []> var_494_transpose_x_0 = const()[name = tensor<string, []>("op_494_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_494_transpose_y_0 = const()[name = tensor<string, []>("op_494_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 1500, 64]> transpose_179 = transpose(perm = var_488, x = var_487_cast);
            tensor<fp16, [1, 16, 1500, 64]> var_494_cast = matmul(transpose_x = var_494_transpose_x_0, transpose_y = var_494_transpose_y_0, x = var_492_cast, y = transpose_179);
            tensor<int32, [4]> var_495 = const()[name = tensor<string, []>("op_495"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_3 = const()[name = tensor<string, []>("concat_3"), val = tensor<int32, [3]>([1, 1500, 1024])];
            tensor<fp16, [1, 1500, 16, 64]> transpose_176 = transpose(perm = var_495, x = var_494_cast);
            tensor<fp16, [1, 1500, 1024]> x_47_cast = reshape(shape = concat_3, x = transpose_176);
            tensor<fp16, [1024, 1024]> var_500_to_fp16 = const()[name = tensor<string, []>("op_500_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91742080)))];
            tensor<fp16, [1024]> var_501_to_fp16 = const()[name = tensor<string, []>("op_501_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93839296)))];
            tensor<fp16, [1, 1500, 1024]> var_502_cast = linear(bias = var_501_to_fp16, weight = var_500_to_fp16, x = x_47_cast);
            tensor<fp16, [1, 1500, 1024]> x_49_cast = add(x = x_43_cast, y = var_502_cast);
            tensor<int32, [1]> var_508_axes_0 = const()[name = tensor<string, []>("op_508_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_3_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93841408)))];
            tensor<fp16, [1024]> blocks_3_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93843520)))];
            tensor<fp16, [1, 1500, 1024]> var_508_cast = layer_norm(axes = var_508_axes_0, beta = blocks_3_mlp_ln_bias_to_fp16, epsilon = var_433_to_fp16, gamma = blocks_3_mlp_ln_weight_to_fp16, x = x_49_cast);
            tensor<fp16, [4096, 1024]> var_517_to_fp16 = const()[name = tensor<string, []>("op_517_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93845632)))];
            tensor<fp16, [4096]> var_518_to_fp16 = const()[name = tensor<string, []>("op_518_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102234304)))];
            tensor<fp16, [1, 1500, 4096]> input_33_cast = linear(bias = var_518_to_fp16, weight = var_517_to_fp16, x = var_508_cast);
            tensor<string, []> x_53_mode_0 = const()[name = tensor<string, []>("x_53_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 4096]> x_53_cast = gelu(mode = x_53_mode_0, x = input_33_cast);
            tensor<fp16, [1024, 4096]> var_523_to_fp16 = const()[name = tensor<string, []>("op_523_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102242560)))];
            tensor<fp16, [1024]> var_524_to_fp16 = const()[name = tensor<string, []>("op_524_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110631232)))];
            tensor<fp16, [1, 1500, 1024]> var_525_cast = linear(bias = var_524_to_fp16, weight = var_523_to_fp16, x = x_53_cast);
            tensor<fp16, [1, 1500, 1024]> x_55_cast = add(x = x_49_cast, y = var_525_cast);
            tensor<int32, []> var_534 = const()[name = tensor<string, []>("op_534"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_551_axes_0 = const()[name = tensor<string, []>("op_551_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> blocks_4_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110633344)))];
            tensor<fp16, [1024]> blocks_4_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110635456)))];
            tensor<fp16, []> var_540_to_fp16 = const()[name = tensor<string, []>("op_540_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1024]> var_551_cast = layer_norm(axes = var_551_axes_0, beta = blocks_4_attn_ln_bias_to_fp16, epsilon = var_540_to_fp16, gamma = blocks_4_attn_ln_weight_to_fp16, x = x_55_cast);
            tensor<fp16, [1024, 1024]> var_562_to_fp16 = const()[name = tensor<string, []>("op_562_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110637568)))];
            tensor<fp16, [1024]> var_563_to_fp16 = const()[name = tensor<string, []>("op_563_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(112734784)))];
            tensor<fp16, [1, 1500, 1024]> q_17_cast = linear(bias = var_563_to_fp16, weight = var_562_to_fp16, x = var_551_cast);
            tensor<fp16, [1024, 1024]> var_566_to_fp16 = const()[name = tensor<string, []>("op_566_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(112736896)))];
            tensor<fp16, [1024]> k_17_bias_0_to_fp16 = const()[name = tensor<string, []>("k_17_bias_0_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(114834112)))];
            tensor<fp16, [1, 1500, 1024]> k_17_cast = linear(bias = k_17_bias_0_to_fp16, weight = var_566_to_fp16, x = var_551_cast);
            tensor<fp16, [1024, 1024]> var_570_to_fp16 = const()[name = tensor<string, []>("op_570_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(114836224)))];
            tensor<fp16, [1024]> var_571_to_fp16 = const()[name = tensor<string, []>("op_571_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116933440)))];
            tensor<fp16, [1, 1500, 1024]> v_17_cast = linear(bias = var_571_to_fp16, weight = var_570_to_fp16, x = var_551_cast);
            tensor<int32, [4]> var_579 = const()[name = tensor<string, []>("op_579"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_580_cast = reshape(shape = var_579, x = q_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_176_to_fp16 = const()[name = tensor<string, []>("const_176_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> q_19_cast = mul(x = var_580_cast, y = const_176_to_fp16);
            tensor<int32, [4]> var_586 = const()[name = tensor<string, []>("op_586"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_587_cast = reshape(shape = var_586, x = k_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_177_to_fp16 = const()[name = tensor<string, []>("const_177_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 16, 64]> k_19_cast = mul(x = var_587_cast, y = const_177_to_fp16);
            tensor<int32, [4]> var_593 = const()[name = tensor<string, []>("op_593"), val = tensor<int32, [4]>([1, 1500, 16, -1])];
            tensor<fp16, [1, 1500, 16, 64]> var_594_cast = reshape(shape = var_593, x = v_17_cast);
            tensor<int32, [4]> var_595 = const()[name = tensor<string, []>("op_595"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_9_transpose_x_0 = const()[name = tensor<string, []>("qk_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_9_transpose_y_0 = const()[name = tensor<string, []>("qk_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_56_perm_0 = const()[name = tensor<string, []>("transpose_56_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_57_perm_0 = const()[name = tensor<string, []>("transpose_57_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 16, 64, 1500]> transpose_173 = transpose(perm = transpose_57_perm_0, x = k_19_cast);
            tensor<fp16, [1, 16, 1500, 64]> transpose_174 = transpose(perm = transpose_56_perm_0, x = q_19_cast);
            tensor<fp16, [1, 16, 1500, 1500]> qk_9_cast = matmul(transpose_x = qk_9_transpose_x_0, transpose_y = qk_9_transpose_y_0, x = transpose_174, y = transpose_173);
            tensor<fp16, [1, 16, 1500, 1500]> var_599_cast = softmax(axis = var_534, x = qk_9_cast);
            tensor<bool, []> var_601_transpose_x_0 = const()[name = tensor<string, []>("op_601_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_601_transpose_y_0 = const()[name = tensor<string, []>("op_601_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 1500, 64]> transpose_175 = transpose(perm = var_595, x = var_594_cast);
            tensor<fp16, [1, 16, 1500, 64]> var_601_cast = matmul(transpose_x = var_601_transpose_x_0, transpose_y = var_601_transpose_y_0, x = var_599_cast, y = transpose_175);
            tensor<int32, [4]> var_602 = const()[name = tensor<string, []>("op_602"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [3]>([1, 1500, 1024])];
            tensor<fp16, [1, 1500, 16, 64]> transpose_172 = transpose(perm = var_602, x = var_601_cast);
            tensor<fp16, [1, 1500, 1024]> x_59_cast = reshape(shape = concat_4, x = transpose_172);
            tensor<fp16, [1024, 1024]> var_607_to_fp16 = const()[name = tensor<string, []>("op_607_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116935552)))];
