program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1436.100.10"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<int32, []> var_32 = const()[name = tensor<string, []>("op_32"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_40 = const()[name = tensor<string, []>("op_40"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_42 = const()[name = tensor<string, []>("op_42"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_44_pad_type_0 = const()[name = tensor<string, []>("op_44_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_44_pad_0 = const()[name = tensor<string, []>("op_44_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [768, 80, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [768, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> bias_3_to_fp16 = const()[name = tensor<string, []>("bias_3_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368768)))];
            tensor<fp16, [1, 80, 3000]> cast_367 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data);
            tensor<fp16, [1, 768, 3000]> var_44_cast = conv(bias = bias_3_to_fp16, dilations = var_42, groups = var_32, pad = var_44_pad_0, pad_type = var_44_pad_type_0, strides = var_40, weight = weight_3_to_fp16, x = cast_367);
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 3000]> input_1_cast = gelu(mode = input_1_mode_0, x = var_44_cast);
            tensor<int32, []> var_48 = const()[name = tensor<string, []>("op_48"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_57 = const()[name = tensor<string, []>("op_57"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_59 = const()[name = tensor<string, []>("op_59"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_61_pad_type_0 = const()[name = tensor<string, []>("op_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_61_pad_0 = const()[name = tensor<string, []>("op_61_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [768, 768, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [768, 768, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(370368)))];
            tensor<fp16, [768]> bias_7_to_fp16 = const()[name = tensor<string, []>("bias_7_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3909376)))];
            tensor<fp16, [1, 768, 1500]> var_61_cast = conv(bias = bias_7_to_fp16, dilations = var_59, groups = var_48, pad = var_61_pad_0, pad_type = var_61_pad_type_0, strides = var_57, weight = weight_7_to_fp16, x = input_1_cast);
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 1500]> x_3_cast = gelu(mode = x_3_mode_0, x = var_61_cast);
            tensor<int32, [3]> var_66 = const()[name = tensor<string, []>("op_66"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1500, 768]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [1500, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3910976)))];
            tensor<fp16, [1, 1500, 768]> transpose_96 = transpose(perm = var_66, x = x_3_cast);
            tensor<fp16, [1, 1500, 768]> var_69_cast = add(x = transpose_96, y = positional_embedding_to_fp16);
            tensor<int32, []> var_82 = const()[name = tensor<string, []>("op_82"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_99_axes_0 = const()[name = tensor<string, []>("op_99_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_0_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6215040)))];
            tensor<fp16, [768]> blocks_0_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6216640)))];
            tensor<fp16, []> var_88_to_fp16 = const()[name = tensor<string, []>("op_88_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_99_cast = layer_norm(axes = var_99_axes_0, beta = blocks_0_attn_ln_bias_to_fp16, epsilon = var_88_to_fp16, gamma = blocks_0_attn_ln_weight_to_fp16, x = var_69_cast);
            tensor<fp16, [768, 768]> var_110_to_fp16 = const()[name = tensor<string, []>("op_110_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6218240)))];
            tensor<fp16, [768]> var_111_to_fp16 = const()[name = tensor<string, []>("op_111_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7397952)))];
            tensor<fp16, [1, 1500, 768]> q_1_cast = linear(bias = var_111_to_fp16, weight = var_110_to_fp16, x = var_99_cast);
            tensor<fp16, [768, 768]> var_114_to_fp16 = const()[name = tensor<string, []>("op_114_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7399552)))];
            tensor<fp16, [768]> k_1_bias_0_to_fp16 = const()[name = tensor<string, []>("k_1_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8579264)))];
            tensor<fp16, [1, 1500, 768]> k_1_cast = linear(bias = k_1_bias_0_to_fp16, weight = var_114_to_fp16, x = var_99_cast);
            tensor<fp16, [768, 768]> var_118_to_fp16 = const()[name = tensor<string, []>("op_118_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8580864)))];
            tensor<fp16, [768]> var_119_to_fp16 = const()[name = tensor<string, []>("op_119_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9760576)))];
            tensor<fp16, [1, 1500, 768]> v_1_cast = linear(bias = var_119_to_fp16, weight = var_118_to_fp16, x = var_99_cast);
            tensor<int32, [4]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_128_cast = reshape(shape = var_127, x = q_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_84_to_fp16 = const()[name = tensor<string, []>("const_84_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> q_3_cast = mul(x = var_128_cast, y = const_84_to_fp16);
            tensor<int32, [4]> var_134 = const()[name = tensor<string, []>("op_134"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_135_cast = reshape(shape = var_134, x = k_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_85_to_fp16 = const()[name = tensor<string, []>("const_85_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> k_3_cast = mul(x = var_135_cast, y = const_85_to_fp16);
            tensor<int32, [4]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_142_cast = reshape(shape = var_141, x = v_1_cast);
            tensor<int32, [4]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_1_transpose_x_0 = const()[name = tensor<string, []>("qk_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_1_transpose_y_0 = const()[name = tensor<string, []>("qk_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_24_perm_0 = const()[name = tensor<string, []>("transpose_24_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_25_perm_0 = const()[name = tensor<string, []>("transpose_25_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 12, 64, 1500]> transpose_93 = transpose(perm = transpose_25_perm_0, x = k_3_cast);
            tensor<fp16, [1, 12, 1500, 64]> transpose_94 = transpose(perm = transpose_24_perm_0, x = q_3_cast);
            tensor<fp16, [1, 12, 1500, 1500]> qk_1_cast = matmul(transpose_x = qk_1_transpose_x_0, transpose_y = qk_1_transpose_y_0, x = transpose_94, y = transpose_93);
            tensor<fp16, [1, 12, 1500, 1500]> var_147_cast = softmax(axis = var_82, x = qk_1_cast);
            tensor<bool, []> var_149_transpose_x_0 = const()[name = tensor<string, []>("op_149_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_149_transpose_y_0 = const()[name = tensor<string, []>("op_149_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> transpose_95 = transpose(perm = var_143, x = var_142_cast);
            tensor<fp16, [1, 12, 1500, 64]> var_149_cast = matmul(transpose_x = var_149_transpose_x_0, transpose_y = var_149_transpose_y_0, x = var_147_cast, y = transpose_95);
            tensor<int32, [4]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> transpose_92 = transpose(perm = var_150, x = var_149_cast);
            tensor<fp16, [1, 1500, 768]> x_11_cast = reshape(shape = concat_0, x = transpose_92);
            tensor<fp16, [768, 768]> var_155_to_fp16 = const()[name = tensor<string, []>("op_155_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9762176)))];
            tensor<fp16, [768]> var_156_to_fp16 = const()[name = tensor<string, []>("op_156_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10941888)))];
            tensor<fp16, [1, 1500, 768]> var_157_cast = linear(bias = var_156_to_fp16, weight = var_155_to_fp16, x = x_11_cast);
            tensor<fp16, [1, 1500, 768]> x_13_cast = add(x = var_69_cast, y = var_157_cast);
            tensor<int32, [1]> var_163_axes_0 = const()[name = tensor<string, []>("op_163_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_0_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10943488)))];
            tensor<fp16, [768]> blocks_0_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10945088)))];
            tensor<fp16, [1, 1500, 768]> var_163_cast = layer_norm(axes = var_163_axes_0, beta = blocks_0_mlp_ln_bias_to_fp16, epsilon = var_88_to_fp16, gamma = blocks_0_mlp_ln_weight_to_fp16, x = x_13_cast);
            tensor<fp16, [3072, 768]> var_172_to_fp16 = const()[name = tensor<string, []>("op_172_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10946688)))];
            tensor<fp16, [3072]> var_173_to_fp16 = const()[name = tensor<string, []>("op_173_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15665344)))];
            tensor<fp16, [1, 1500, 3072]> input_9_cast = linear(bias = var_173_to_fp16, weight = var_172_to_fp16, x = var_163_cast);
            tensor<string, []> x_17_mode_0 = const()[name = tensor<string, []>("x_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_17_cast = gelu(mode = x_17_mode_0, x = input_9_cast);
            tensor<fp16, [768, 3072]> var_178_to_fp16 = const()[name = tensor<string, []>("op_178_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15671552)))];
            tensor<fp16, [768]> var_179_to_fp16 = const()[name = tensor<string, []>("op_179_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390208)))];
            tensor<fp16, [1, 1500, 768]> var_180_cast = linear(bias = var_179_to_fp16, weight = var_178_to_fp16, x = x_17_cast);
            tensor<fp16, [1, 1500, 768]> x_19_cast = add(x = x_13_cast, y = var_180_cast);
            tensor<int32, []> var_189 = const()[name = tensor<string, []>("op_189"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_206_axes_0 = const()[name = tensor<string, []>("op_206_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_1_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20391808)))];
            tensor<fp16, [768]> blocks_1_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20393408)))];
            tensor<fp16, []> var_195_to_fp16 = const()[name = tensor<string, []>("op_195_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_206_cast = layer_norm(axes = var_206_axes_0, beta = blocks_1_attn_ln_bias_to_fp16, epsilon = var_195_to_fp16, gamma = blocks_1_attn_ln_weight_to_fp16, x = x_19_cast);
            tensor<fp16, [768, 768]> var_217_to_fp16 = const()[name = tensor<string, []>("op_217_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20395008)))];
            tensor<fp16, [768]> var_218_to_fp16 = const()[name = tensor<string, []>("op_218_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21574720)))];
            tensor<fp16, [1, 1500, 768]> q_5_cast = linear(bias = var_218_to_fp16, weight = var_217_to_fp16, x = var_206_cast);
            tensor<fp16, [768, 768]> var_221_to_fp16 = const()[name = tensor<string, []>("op_221_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21576320)))];
            tensor<fp16, [768]> k_5_bias_0_to_fp16 = const()[name = tensor<string, []>("k_5_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22756032)))];
            tensor<fp16, [1, 1500, 768]> k_5_cast = linear(bias = k_5_bias_0_to_fp16, weight = var_221_to_fp16, x = var_206_cast);
            tensor<fp16, [768, 768]> var_225_to_fp16 = const()[name = tensor<string, []>("op_225_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22757632)))];
            tensor<fp16, [768]> var_226_to_fp16 = const()[name = tensor<string, []>("op_226_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23937344)))];
            tensor<fp16, [1, 1500, 768]> v_5_cast = linear(bias = var_226_to_fp16, weight = var_225_to_fp16, x = var_206_cast);
            tensor<int32, [4]> var_234 = const()[name = tensor<string, []>("op_234"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_235_cast = reshape(shape = var_234, x = q_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_86_to_fp16 = const()[name = tensor<string, []>("const_86_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> q_7_cast = mul(x = var_235_cast, y = const_86_to_fp16);
            tensor<int32, [4]> var_241 = const()[name = tensor<string, []>("op_241"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_242_cast = reshape(shape = var_241, x = k_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_87_to_fp16 = const()[name = tensor<string, []>("const_87_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> k_7_cast = mul(x = var_242_cast, y = const_87_to_fp16);
            tensor<int32, [4]> var_248 = const()[name = tensor<string, []>("op_248"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_249_cast = reshape(shape = var_248, x = v_5_cast);
            tensor<int32, [4]> var_250 = const()[name = tensor<string, []>("op_250"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_3_transpose_x_0 = const()[name = tensor<string, []>("qk_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_3_transpose_y_0 = const()[name = tensor<string, []>("qk_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_26_perm_0 = const()[name = tensor<string, []>("transpose_26_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_27_perm_0 = const()[name = tensor<string, []>("transpose_27_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 12, 64, 1500]> transpose_89 = transpose(perm = transpose_27_perm_0, x = k_7_cast);
            tensor<fp16, [1, 12, 1500, 64]> transpose_90 = transpose(perm = transpose_26_perm_0, x = q_7_cast);
            tensor<fp16, [1, 12, 1500, 1500]> qk_3_cast = matmul(transpose_x = qk_3_transpose_x_0, transpose_y = qk_3_transpose_y_0, x = transpose_90, y = transpose_89);
            tensor<fp16, [1, 12, 1500, 1500]> var_254_cast = softmax(axis = var_189, x = qk_3_cast);
            tensor<bool, []> var_256_transpose_x_0 = const()[name = tensor<string, []>("op_256_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_256_transpose_y_0 = const()[name = tensor<string, []>("op_256_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> transpose_91 = transpose(perm = var_250, x = var_249_cast);
            tensor<fp16, [1, 12, 1500, 64]> var_256_cast = matmul(transpose_x = var_256_transpose_x_0, transpose_y = var_256_transpose_y_0, x = var_254_cast, y = transpose_91);
            tensor<int32, [4]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_1 = const()[name = tensor<string, []>("concat_1"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> transpose_88 = transpose(perm = var_257, x = var_256_cast);
            tensor<fp16, [1, 1500, 768]> x_23_cast = reshape(shape = concat_1, x = transpose_88);
            tensor<fp16, [768, 768]> var_262_to_fp16 = const()[name = tensor<string, []>("op_262_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23938944)))];
            tensor<fp16, [768]> var_263_to_fp16 = const()[name = tensor<string, []>("op_263_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25118656)))];
            tensor<fp16, [1, 1500, 768]> var_264_cast = linear(bias = var_263_to_fp16, weight = var_262_to_fp16, x = x_23_cast);
            tensor<fp16, [1, 1500, 768]> x_25_cast = add(x = x_19_cast, y = var_264_cast);
            tensor<int32, [1]> var_270_axes_0 = const()[name = tensor<string, []>("op_270_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_1_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25120256)))];
            tensor<fp16, [768]> blocks_1_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25121856)))];
            tensor<fp16, [1, 1500, 768]> var_270_cast = layer_norm(axes = var_270_axes_0, beta = blocks_1_mlp_ln_bias_to_fp16, epsilon = var_195_to_fp16, gamma = blocks_1_mlp_ln_weight_to_fp16, x = x_25_cast);
            tensor<fp16, [3072, 768]> var_279_to_fp16 = const()[name = tensor<string, []>("op_279_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25123456)))];
            tensor<fp16, [3072]> var_280_to_fp16 = const()[name = tensor<string, []>("op_280_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29842112)))];
            tensor<fp16, [1, 1500, 3072]> input_17_cast = linear(bias = var_280_to_fp16, weight = var_279_to_fp16, x = var_270_cast);
            tensor<string, []> x_29_mode_0 = const()[name = tensor<string, []>("x_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_29_cast = gelu(mode = x_29_mode_0, x = input_17_cast);
            tensor<fp16, [768, 3072]> var_285_to_fp16 = const()[name = tensor<string, []>("op_285_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29848320)))];
            tensor<fp16, [768]> var_286_to_fp16 = const()[name = tensor<string, []>("op_286_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34566976)))];
            tensor<fp16, [1, 1500, 768]> var_287_cast = linear(bias = var_286_to_fp16, weight = var_285_to_fp16, x = x_29_cast);
            tensor<fp16, [1, 1500, 768]> x_31_cast = add(x = x_25_cast, y = var_287_cast);
            tensor<int32, []> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_313_axes_0 = const()[name = tensor<string, []>("op_313_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_2_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34568576)))];
            tensor<fp16, [768]> blocks_2_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34570176)))];
            tensor<fp16, []> var_302_to_fp16 = const()[name = tensor<string, []>("op_302_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_313_cast = layer_norm(axes = var_313_axes_0, beta = blocks_2_attn_ln_bias_to_fp16, epsilon = var_302_to_fp16, gamma = blocks_2_attn_ln_weight_to_fp16, x = x_31_cast);
            tensor<fp16, [768, 768]> var_324_to_fp16 = const()[name = tensor<string, []>("op_324_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34571776)))];
            tensor<fp16, [768]> var_325_to_fp16 = const()[name = tensor<string, []>("op_325_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35751488)))];
            tensor<fp16, [1, 1500, 768]> q_9_cast = linear(bias = var_325_to_fp16, weight = var_324_to_fp16, x = var_313_cast);
            tensor<fp16, [768, 768]> var_328_to_fp16 = const()[name = tensor<string, []>("op_328_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35753088)))];
            tensor<fp16, [768]> k_9_bias_0_to_fp16 = const()[name = tensor<string, []>("k_9_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36932800)))];
            tensor<fp16, [1, 1500, 768]> k_9_cast = linear(bias = k_9_bias_0_to_fp16, weight = var_328_to_fp16, x = var_313_cast);
            tensor<fp16, [768, 768]> var_332_to_fp16 = const()[name = tensor<string, []>("op_332_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36934400)))];
            tensor<fp16, [768]> var_333_to_fp16 = const()[name = tensor<string, []>("op_333_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38114112)))];
            tensor<fp16, [1, 1500, 768]> v_9_cast = linear(bias = var_333_to_fp16, weight = var_332_to_fp16, x = var_313_cast);
            tensor<int32, [4]> var_341 = const()[name = tensor<string, []>("op_341"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_342_cast = reshape(shape = var_341, x = q_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_88_to_fp16 = const()[name = tensor<string, []>("const_88_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> q_11_cast = mul(x = var_342_cast, y = const_88_to_fp16);
            tensor<int32, [4]> var_348 = const()[name = tensor<string, []>("op_348"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_349_cast = reshape(shape = var_348, x = k_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_89_to_fp16 = const()[name = tensor<string, []>("const_89_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> k_11_cast = mul(x = var_349_cast, y = const_89_to_fp16);
            tensor<int32, [4]> var_355 = const()[name = tensor<string, []>("op_355"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_356_cast = reshape(shape = var_355, x = v_9_cast);
            tensor<int32, [4]> var_357 = const()[name = tensor<string, []>("op_357"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_5_transpose_x_0 = const()[name = tensor<string, []>("qk_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_5_transpose_y_0 = const()[name = tensor<string, []>("qk_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_28_perm_0 = const()[name = tensor<string, []>("transpose_28_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_29_perm_0 = const()[name = tensor<string, []>("transpose_29_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 12, 64, 1500]> transpose_85 = transpose(perm = transpose_29_perm_0, x = k_11_cast);
            tensor<fp16, [1, 12, 1500, 64]> transpose_86 = transpose(perm = transpose_28_perm_0, x = q_11_cast);
            tensor<fp16, [1, 12, 1500, 1500]> qk_5_cast = matmul(transpose_x = qk_5_transpose_x_0, transpose_y = qk_5_transpose_y_0, x = transpose_86, y = transpose_85);
            tensor<fp16, [1, 12, 1500, 1500]> var_361_cast = softmax(axis = var_296, x = qk_5_cast);
            tensor<bool, []> var_363_transpose_x_0 = const()[name = tensor<string, []>("op_363_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_363_transpose_y_0 = const()[name = tensor<string, []>("op_363_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> transpose_87 = transpose(perm = var_357, x = var_356_cast);
            tensor<fp16, [1, 12, 1500, 64]> var_363_cast = matmul(transpose_x = var_363_transpose_x_0, transpose_y = var_363_transpose_y_0, x = var_361_cast, y = transpose_87);
            tensor<int32, [4]> var_364 = const()[name = tensor<string, []>("op_364"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_2 = const()[name = tensor<string, []>("concat_2"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> transpose_84 = transpose(perm = var_364, x = var_363_cast);
            tensor<fp16, [1, 1500, 768]> x_35_cast = reshape(shape = concat_2, x = transpose_84);
            tensor<fp16, [768, 768]> var_369_to_fp16 = const()[name = tensor<string, []>("op_369_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38115712)))];
            tensor<fp16, [768]> var_370_to_fp16 = const()[name = tensor<string, []>("op_370_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39295424)))];
            tensor<fp16, [1, 1500, 768]> var_371_cast = linear(bias = var_370_to_fp16, weight = var_369_to_fp16, x = x_35_cast);
            tensor<fp16, [1, 1500, 768]> x_37_cast = add(x = x_31_cast, y = var_371_cast);
            tensor<int32, [1]> var_377_axes_0 = const()[name = tensor<string, []>("op_377_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_2_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39297024)))];
            tensor<fp16, [768]> blocks_2_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39298624)))];
            tensor<fp16, [1, 1500, 768]> var_377_cast = layer_norm(axes = var_377_axes_0, beta = blocks_2_mlp_ln_bias_to_fp16, epsilon = var_302_to_fp16, gamma = blocks_2_mlp_ln_weight_to_fp16, x = x_37_cast);
            tensor<fp16, [3072, 768]> var_386_to_fp16 = const()[name = tensor<string, []>("op_386_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39300224)))];
            tensor<fp16, [3072]> var_387_to_fp16 = const()[name = tensor<string, []>("op_387_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44018880)))];
            tensor<fp16, [1, 1500, 3072]> input_25_cast = linear(bias = var_387_to_fp16, weight = var_386_to_fp16, x = var_377_cast);
            tensor<string, []> x_41_mode_0 = const()[name = tensor<string, []>("x_41_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_41_cast = gelu(mode = x_41_mode_0, x = input_25_cast);
            tensor<fp16, [768, 3072]> var_392_to_fp16 = const()[name = tensor<string, []>("op_392_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44025088)))];
            tensor<fp16, [768]> var_393_to_fp16 = const()[name = tensor<string, []>("op_393_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48743744)))];
            tensor<fp16, [1, 1500, 768]> var_394_cast = linear(bias = var_393_to_fp16, weight = var_392_to_fp16, x = x_41_cast);
            tensor<fp16, [1, 1500, 768]> x_43_cast = add(x = x_37_cast, y = var_394_cast);
            tensor<int32, []> var_403 = const()[name = tensor<string, []>("op_403"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_420_axes_0 = const()[name = tensor<string, []>("op_420_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_3_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48745344)))];
            tensor<fp16, [768]> blocks_3_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48746944)))];
            tensor<fp16, []> var_409_to_fp16 = const()[name = tensor<string, []>("op_409_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_420_cast = layer_norm(axes = var_420_axes_0, beta = blocks_3_attn_ln_bias_to_fp16, epsilon = var_409_to_fp16, gamma = blocks_3_attn_ln_weight_to_fp16, x = x_43_cast);
            tensor<fp16, [768, 768]> var_431_to_fp16 = const()[name = tensor<string, []>("op_431_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(48748544)))];
            tensor<fp16, [768]> var_432_to_fp16 = const()[name = tensor<string, []>("op_432_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49928256)))];
            tensor<fp16, [1, 1500, 768]> q_13_cast = linear(bias = var_432_to_fp16, weight = var_431_to_fp16, x = var_420_cast);
            tensor<fp16, [768, 768]> var_435_to_fp16 = const()[name = tensor<string, []>("op_435_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49929856)))];
            tensor<fp16, [768]> k_13_bias_0_to_fp16 = const()[name = tensor<string, []>("k_13_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51109568)))];
            tensor<fp16, [1, 1500, 768]> k_13_cast = linear(bias = k_13_bias_0_to_fp16, weight = var_435_to_fp16, x = var_420_cast);
            tensor<fp16, [768, 768]> var_439_to_fp16 = const()[name = tensor<string, []>("op_439_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51111168)))];
            tensor<fp16, [768]> var_440_to_fp16 = const()[name = tensor<string, []>("op_440_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52290880)))];
            tensor<fp16, [1, 1500, 768]> v_13_cast = linear(bias = var_440_to_fp16, weight = var_439_to_fp16, x = var_420_cast);
            tensor<int32, [4]> var_448 = const()[name = tensor<string, []>("op_448"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_449_cast = reshape(shape = var_448, x = q_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_90_to_fp16 = const()[name = tensor<string, []>("const_90_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> q_15_cast = mul(x = var_449_cast, y = const_90_to_fp16);
            tensor<int32, [4]> var_455 = const()[name = tensor<string, []>("op_455"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_456_cast = reshape(shape = var_455, x = k_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_91_to_fp16 = const()[name = tensor<string, []>("const_91_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> k_15_cast = mul(x = var_456_cast, y = const_91_to_fp16);
            tensor<int32, [4]> var_462 = const()[name = tensor<string, []>("op_462"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_463_cast = reshape(shape = var_462, x = v_13_cast);
            tensor<int32, [4]> var_464 = const()[name = tensor<string, []>("op_464"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_7_transpose_x_0 = const()[name = tensor<string, []>("qk_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_7_transpose_y_0 = const()[name = tensor<string, []>("qk_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_30_perm_0 = const()[name = tensor<string, []>("transpose_30_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_31_perm_0 = const()[name = tensor<string, []>("transpose_31_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 12, 64, 1500]> transpose_81 = transpose(perm = transpose_31_perm_0, x = k_15_cast);
            tensor<fp16, [1, 12, 1500, 64]> transpose_82 = transpose(perm = transpose_30_perm_0, x = q_15_cast);
            tensor<fp16, [1, 12, 1500, 1500]> qk_7_cast = matmul(transpose_x = qk_7_transpose_x_0, transpose_y = qk_7_transpose_y_0, x = transpose_82, y = transpose_81);
            tensor<fp16, [1, 12, 1500, 1500]> var_468_cast = softmax(axis = var_403, x = qk_7_cast);
            tensor<bool, []> var_470_transpose_x_0 = const()[name = tensor<string, []>("op_470_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_470_transpose_y_0 = const()[name = tensor<string, []>("op_470_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> transpose_83 = transpose(perm = var_464, x = var_463_cast);
            tensor<fp16, [1, 12, 1500, 64]> var_470_cast = matmul(transpose_x = var_470_transpose_x_0, transpose_y = var_470_transpose_y_0, x = var_468_cast, y = transpose_83);
            tensor<int32, [4]> var_471 = const()[name = tensor<string, []>("op_471"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_3 = const()[name = tensor<string, []>("concat_3"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> transpose_80 = transpose(perm = var_471, x = var_470_cast);
            tensor<fp16, [1, 1500, 768]> x_47_cast = reshape(shape = concat_3, x = transpose_80);
            tensor<fp16, [768, 768]> var_476_to_fp16 = const()[name = tensor<string, []>("op_476_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52292480)))];
            tensor<fp16, [768]> var_477_to_fp16 = const()[name = tensor<string, []>("op_477_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53472192)))];
            tensor<fp16, [1, 1500, 768]> var_478_cast = linear(bias = var_477_to_fp16, weight = var_476_to_fp16, x = x_47_cast);
            tensor<fp16, [1, 1500, 768]> x_49_cast = add(x = x_43_cast, y = var_478_cast);
            tensor<int32, [1]> var_484_axes_0 = const()[name = tensor<string, []>("op_484_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_3_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53473792)))];
            tensor<fp16, [768]> blocks_3_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53475392)))];
            tensor<fp16, [1, 1500, 768]> var_484_cast = layer_norm(axes = var_484_axes_0, beta = blocks_3_mlp_ln_bias_to_fp16, epsilon = var_409_to_fp16, gamma = blocks_3_mlp_ln_weight_to_fp16, x = x_49_cast);
            tensor<fp16, [3072, 768]> var_493_to_fp16 = const()[name = tensor<string, []>("op_493_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53476992)))];
            tensor<fp16, [3072]> var_494_to_fp16 = const()[name = tensor<string, []>("op_494_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58195648)))];
            tensor<fp16, [1, 1500, 3072]> input_33_cast = linear(bias = var_494_to_fp16, weight = var_493_to_fp16, x = var_484_cast);
            tensor<string, []> x_53_mode_0 = const()[name = tensor<string, []>("x_53_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 3072]> x_53_cast = gelu(mode = x_53_mode_0, x = input_33_cast);
            tensor<fp16, [768, 3072]> var_499_to_fp16 = const()[name = tensor<string, []>("op_499_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58201856)))];
            tensor<fp16, [768]> var_500_to_fp16 = const()[name = tensor<string, []>("op_500_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62920512)))];
            tensor<fp16, [1, 1500, 768]> var_501_cast = linear(bias = var_500_to_fp16, weight = var_499_to_fp16, x = x_53_cast);
            tensor<fp16, [1, 1500, 768]> x_55_cast = add(x = x_49_cast, y = var_501_cast);
            tensor<int32, []> var_510 = const()[name = tensor<string, []>("op_510"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_527_axes_0 = const()[name = tensor<string, []>("op_527_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> blocks_4_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62922112)))];
            tensor<fp16, [768]> blocks_4_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62923712)))];
            tensor<fp16, []> var_516_to_fp16 = const()[name = tensor<string, []>("op_516_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 768]> var_527_cast = layer_norm(axes = var_527_axes_0, beta = blocks_4_attn_ln_bias_to_fp16, epsilon = var_516_to_fp16, gamma = blocks_4_attn_ln_weight_to_fp16, x = x_55_cast);
            tensor<fp16, [768, 768]> var_538_to_fp16 = const()[name = tensor<string, []>("op_538_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62925312)))];
            tensor<fp16, [768]> var_539_to_fp16 = const()[name = tensor<string, []>("op_539_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64105024)))];
            tensor<fp16, [1, 1500, 768]> q_17_cast = linear(bias = var_539_to_fp16, weight = var_538_to_fp16, x = var_527_cast);
            tensor<fp16, [768, 768]> var_542_to_fp16 = const()[name = tensor<string, []>("op_542_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64106624)))];
            tensor<fp16, [768]> k_17_bias_0_to_fp16 = const()[name = tensor<string, []>("k_17_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65286336)))];
            tensor<fp16, [1, 1500, 768]> k_17_cast = linear(bias = k_17_bias_0_to_fp16, weight = var_542_to_fp16, x = var_527_cast);
            tensor<fp16, [768, 768]> var_546_to_fp16 = const()[name = tensor<string, []>("op_546_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65287936)))];
            tensor<fp16, [768]> var_547_to_fp16 = const()[name = tensor<string, []>("op_547_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66467648)))];
            tensor<fp16, [1, 1500, 768]> v_17_cast = linear(bias = var_547_to_fp16, weight = var_546_to_fp16, x = var_527_cast);
            tensor<int32, [4]> var_555 = const()[name = tensor<string, []>("op_555"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_556_cast = reshape(shape = var_555, x = q_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_92_to_fp16 = const()[name = tensor<string, []>("const_92_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> q_19_cast = mul(x = var_556_cast, y = const_92_to_fp16);
            tensor<int32, [4]> var_562 = const()[name = tensor<string, []>("op_562"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_563_cast = reshape(shape = var_562, x = k_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_93_to_fp16 = const()[name = tensor<string, []>("const_93_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 12, 64]> k_19_cast = mul(x = var_563_cast, y = const_93_to_fp16);
            tensor<int32, [4]> var_569 = const()[name = tensor<string, []>("op_569"), val = tensor<int32, [4]>([1, 1500, 12, -1])];
            tensor<fp16, [1, 1500, 12, 64]> var_570_cast = reshape(shape = var_569, x = v_17_cast);
            tensor<int32, [4]> var_571 = const()[name = tensor<string, []>("op_571"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_9_transpose_x_0 = const()[name = tensor<string, []>("qk_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_9_transpose_y_0 = const()[name = tensor<string, []>("qk_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_32_perm_0 = const()[name = tensor<string, []>("transpose_32_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_33_perm_0 = const()[name = tensor<string, []>("transpose_33_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 12, 64, 1500]> transpose_77 = transpose(perm = transpose_33_perm_0, x = k_19_cast);
            tensor<fp16, [1, 12, 1500, 64]> transpose_78 = transpose(perm = transpose_32_perm_0, x = q_19_cast);
            tensor<fp16, [1, 12, 1500, 1500]> qk_9_cast = matmul(transpose_x = qk_9_transpose_x_0, transpose_y = qk_9_transpose_y_0, x = transpose_78, y = transpose_77);
            tensor<fp16, [1, 12, 1500, 1500]> var_575_cast = softmax(axis = var_510, x = qk_9_cast);
            tensor<bool, []> var_577_transpose_x_0 = const()[name = tensor<string, []>("op_577_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_577_transpose_y_0 = const()[name = tensor<string, []>("op_577_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 1500, 64]> transpose_79 = transpose(perm = var_571, x = var_570_cast);
            tensor<fp16, [1, 12, 1500, 64]> var_577_cast = matmul(transpose_x = var_577_transpose_x_0, transpose_y = var_577_transpose_y_0, x = var_575_cast, y = transpose_79);
            tensor<int32, [4]> var_578 = const()[name = tensor<string, []>("op_578"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [3]>([1, 1500, 768])];
            tensor<fp16, [1, 1500, 12, 64]> transpose_76 = transpose(perm = var_578, x = var_577_cast);
            tensor<fp16, [1, 1500, 768]> x_59_cast = reshape(shape = concat_4, x = transpose_76);
            tensor<fp16, [768, 768]> var_583_to_fp16 = const()[name = tensor<string, []>("op_583_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66469248)))];
            tensor<fp16, [768]> var_584_to_fp16 = const()[name = tensor<string, []>("op_584_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67648960)))];
            tensor<fp16, [1, 1500, 768]> var_585_cast = linear(bias = var_584_to_fp16, weight = var_583_to_fp16, x = x_59_cast);
            tensor<fp16, [1, 1500, 768]> x_61_cast = add(x = x_55_cast, y = var_585_cast);
