program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1436.100.10"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_82 = const()[name = tensor<string, []>("op_82"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_84_pad_type_0 = const()[name = tensor<string, []>("op_84_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_84_pad_0 = const()[name = tensor<string, []>("op_84_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1280, 80, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [1280, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> bias_3_to_fp16 = const()[name = tensor<string, []>("bias_3_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(614528)))];
            tensor<fp16, [1, 80, 3000]> cast_967 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data);
            tensor<fp16, [1, 1280, 3000]> var_84_cast = conv(bias = bias_3_to_fp16, dilations = var_82, groups = var_72, pad = var_84_pad_0, pad_type = var_84_pad_type_0, strides = var_80, weight = weight_3_to_fp16, x = cast_967);
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 3000]> input_1_cast = gelu(mode = input_1_mode_0, x = var_84_cast);
            tensor<int32, []> var_88 = const()[name = tensor<string, []>("op_88"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_97 = const()[name = tensor<string, []>("op_97"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_101_pad_type_0 = const()[name = tensor<string, []>("op_101_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_101_pad_0 = const()[name = tensor<string, []>("op_101_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1280, 1280, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [1280, 1280, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(617152)))];
            tensor<fp16, [1280]> bias_7_to_fp16 = const()[name = tensor<string, []>("bias_7_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10447616)))];
            tensor<fp16, [1, 1280, 1500]> var_101_cast = conv(bias = bias_7_to_fp16, dilations = var_99, groups = var_88, pad = var_101_pad_0, pad_type = var_101_pad_type_0, strides = var_97, weight = weight_7_to_fp16, x = input_1_cast);
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1500]> x_3_cast = gelu(mode = x_3_mode_0, x = var_101_cast);
            tensor<int32, [3]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1500, 1280]> positional_embedding_to_fp16 = const()[name = tensor<string, []>("positional_embedding_to_fp16"), val = tensor<fp16, [1500, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10450240)))];
            tensor<fp16, [1, 1500, 1280]> transpose_256 = transpose(perm = var_106, x = x_3_cast);
            tensor<fp16, [1, 1500, 1280]> var_109_cast = add(x = transpose_256, y = positional_embedding_to_fp16);
            tensor<int32, []> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_139_axes_0 = const()[name = tensor<string, []>("op_139_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_0_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14290304)))];
            tensor<fp16, [1280]> blocks_0_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14292928)))];
            tensor<fp16, []> var_128_to_fp16 = const()[name = tensor<string, []>("op_128_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1280]> var_139_cast = layer_norm(axes = var_139_axes_0, beta = blocks_0_attn_ln_bias_to_fp16, epsilon = var_128_to_fp16, gamma = blocks_0_attn_ln_weight_to_fp16, x = var_109_cast);
            tensor<fp16, [1280, 1280]> var_150_to_fp16 = const()[name = tensor<string, []>("op_150_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14295552)))];
            tensor<fp16, [1280]> var_151_to_fp16 = const()[name = tensor<string, []>("op_151_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17572416)))];
            tensor<fp16, [1, 1500, 1280]> q_1_cast = linear(bias = var_151_to_fp16, weight = var_150_to_fp16, x = var_139_cast);
            tensor<fp16, [1280, 1280]> var_154_to_fp16 = const()[name = tensor<string, []>("op_154_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17575040)))];
            tensor<fp16, [1280]> k_1_bias_0_to_fp16 = const()[name = tensor<string, []>("k_1_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20851904)))];
            tensor<fp16, [1, 1500, 1280]> k_1_cast = linear(bias = k_1_bias_0_to_fp16, weight = var_154_to_fp16, x = var_139_cast);
            tensor<fp16, [1280, 1280]> var_158_to_fp16 = const()[name = tensor<string, []>("op_158_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20854528)))];
            tensor<fp16, [1280]> var_159_to_fp16 = const()[name = tensor<string, []>("op_159_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24131392)))];
            tensor<fp16, [1, 1500, 1280]> v_1_cast = linear(bias = var_159_to_fp16, weight = var_158_to_fp16, x = var_139_cast);
            tensor<int32, [4]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_168_cast = reshape(shape = var_167, x = q_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_224_to_fp16 = const()[name = tensor<string, []>("const_224_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> q_3_cast = mul(x = var_168_cast, y = const_224_to_fp16);
            tensor<int32, [4]> var_174 = const()[name = tensor<string, []>("op_174"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_175_cast = reshape(shape = var_174, x = k_1_cast);
            tensor<fp16, [1, 1, 1, 1]> const_225_to_fp16 = const()[name = tensor<string, []>("const_225_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> k_3_cast = mul(x = var_175_cast, y = const_225_to_fp16);
            tensor<int32, [4]> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_182_cast = reshape(shape = var_181, x = v_1_cast);
            tensor<int32, [4]> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_1_transpose_x_0 = const()[name = tensor<string, []>("qk_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_1_transpose_y_0 = const()[name = tensor<string, []>("qk_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_64_perm_0 = const()[name = tensor<string, []>("transpose_64_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_65_perm_0 = const()[name = tensor<string, []>("transpose_65_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 20, 64, 1500]> transpose_253 = transpose(perm = transpose_65_perm_0, x = k_3_cast);
            tensor<fp16, [1, 20, 1500, 64]> transpose_254 = transpose(perm = transpose_64_perm_0, x = q_3_cast);
            tensor<fp16, [1, 20, 1500, 1500]> qk_1_cast = matmul(transpose_x = qk_1_transpose_x_0, transpose_y = qk_1_transpose_y_0, x = transpose_254, y = transpose_253);
            tensor<fp16, [1, 20, 1500, 1500]> var_187_cast = softmax(axis = var_122, x = qk_1_cast);
            tensor<bool, []> var_189_transpose_x_0 = const()[name = tensor<string, []>("op_189_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_189_transpose_y_0 = const()[name = tensor<string, []>("op_189_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 64]> transpose_255 = transpose(perm = var_183, x = var_182_cast);
            tensor<fp16, [1, 20, 1500, 64]> var_189_cast = matmul(transpose_x = var_189_transpose_x_0, transpose_y = var_189_transpose_y_0, x = var_187_cast, y = transpose_255);
            tensor<int32, [4]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 1500, 1280])];
            tensor<fp16, [1, 1500, 20, 64]> transpose_252 = transpose(perm = var_190, x = var_189_cast);
            tensor<fp16, [1, 1500, 1280]> x_11_cast = reshape(shape = concat_0, x = transpose_252);
            tensor<fp16, [1280, 1280]> var_195_to_fp16 = const()[name = tensor<string, []>("op_195_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24134016)))];
            tensor<fp16, [1280]> var_196_to_fp16 = const()[name = tensor<string, []>("op_196_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27410880)))];
            tensor<fp16, [1, 1500, 1280]> var_197_cast = linear(bias = var_196_to_fp16, weight = var_195_to_fp16, x = x_11_cast);
            tensor<fp16, [1, 1500, 1280]> x_13_cast = add(x = var_109_cast, y = var_197_cast);
            tensor<int32, [1]> var_203_axes_0 = const()[name = tensor<string, []>("op_203_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_0_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27413504)))];
            tensor<fp16, [1280]> blocks_0_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27416128)))];
            tensor<fp16, [1, 1500, 1280]> var_203_cast = layer_norm(axes = var_203_axes_0, beta = blocks_0_mlp_ln_bias_to_fp16, epsilon = var_128_to_fp16, gamma = blocks_0_mlp_ln_weight_to_fp16, x = x_13_cast);
            tensor<fp16, [5120, 1280]> var_212_to_fp16 = const()[name = tensor<string, []>("op_212_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27418752)))];
            tensor<fp16, [5120]> var_213_to_fp16 = const()[name = tensor<string, []>("op_213_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40526016)))];
            tensor<fp16, [1, 1500, 5120]> input_9_cast = linear(bias = var_213_to_fp16, weight = var_212_to_fp16, x = var_203_cast);
            tensor<string, []> x_17_mode_0 = const()[name = tensor<string, []>("x_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 5120]> x_17_cast = gelu(mode = x_17_mode_0, x = input_9_cast);
            tensor<fp16, [1280, 5120]> var_218_to_fp16 = const()[name = tensor<string, []>("op_218_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40536320)))];
            tensor<fp16, [1280]> var_219_to_fp16 = const()[name = tensor<string, []>("op_219_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53643584)))];
            tensor<fp16, [1, 1500, 1280]> var_220_cast = linear(bias = var_219_to_fp16, weight = var_218_to_fp16, x = x_17_cast);
            tensor<fp16, [1, 1500, 1280]> x_19_cast = add(x = x_13_cast, y = var_220_cast);
            tensor<int32, []> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_246_axes_0 = const()[name = tensor<string, []>("op_246_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_1_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53646208)))];
            tensor<fp16, [1280]> blocks_1_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53648832)))];
            tensor<fp16, []> var_235_to_fp16 = const()[name = tensor<string, []>("op_235_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1280]> var_246_cast = layer_norm(axes = var_246_axes_0, beta = blocks_1_attn_ln_bias_to_fp16, epsilon = var_235_to_fp16, gamma = blocks_1_attn_ln_weight_to_fp16, x = x_19_cast);
            tensor<fp16, [1280, 1280]> var_257_to_fp16 = const()[name = tensor<string, []>("op_257_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(53651456)))];
            tensor<fp16, [1280]> var_258_to_fp16 = const()[name = tensor<string, []>("op_258_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56928320)))];
            tensor<fp16, [1, 1500, 1280]> q_5_cast = linear(bias = var_258_to_fp16, weight = var_257_to_fp16, x = var_246_cast);
            tensor<fp16, [1280, 1280]> var_261_to_fp16 = const()[name = tensor<string, []>("op_261_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56930944)))];
            tensor<fp16, [1280]> k_5_bias_0_to_fp16 = const()[name = tensor<string, []>("k_5_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60207808)))];
            tensor<fp16, [1, 1500, 1280]> k_5_cast = linear(bias = k_5_bias_0_to_fp16, weight = var_261_to_fp16, x = var_246_cast);
            tensor<fp16, [1280, 1280]> var_265_to_fp16 = const()[name = tensor<string, []>("op_265_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60210432)))];
            tensor<fp16, [1280]> var_266_to_fp16 = const()[name = tensor<string, []>("op_266_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63487296)))];
            tensor<fp16, [1, 1500, 1280]> v_5_cast = linear(bias = var_266_to_fp16, weight = var_265_to_fp16, x = var_246_cast);
            tensor<int32, [4]> var_274 = const()[name = tensor<string, []>("op_274"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_275_cast = reshape(shape = var_274, x = q_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_226_to_fp16 = const()[name = tensor<string, []>("const_226_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> q_7_cast = mul(x = var_275_cast, y = const_226_to_fp16);
            tensor<int32, [4]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_282_cast = reshape(shape = var_281, x = k_5_cast);
            tensor<fp16, [1, 1, 1, 1]> const_227_to_fp16 = const()[name = tensor<string, []>("const_227_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> k_7_cast = mul(x = var_282_cast, y = const_227_to_fp16);
            tensor<int32, [4]> var_288 = const()[name = tensor<string, []>("op_288"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_289_cast = reshape(shape = var_288, x = v_5_cast);
            tensor<int32, [4]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_3_transpose_x_0 = const()[name = tensor<string, []>("qk_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_3_transpose_y_0 = const()[name = tensor<string, []>("qk_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_66_perm_0 = const()[name = tensor<string, []>("transpose_66_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_67_perm_0 = const()[name = tensor<string, []>("transpose_67_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 20, 64, 1500]> transpose_249 = transpose(perm = transpose_67_perm_0, x = k_7_cast);
            tensor<fp16, [1, 20, 1500, 64]> transpose_250 = transpose(perm = transpose_66_perm_0, x = q_7_cast);
            tensor<fp16, [1, 20, 1500, 1500]> qk_3_cast = matmul(transpose_x = qk_3_transpose_x_0, transpose_y = qk_3_transpose_y_0, x = transpose_250, y = transpose_249);
            tensor<fp16, [1, 20, 1500, 1500]> var_294_cast = softmax(axis = var_229, x = qk_3_cast);
            tensor<bool, []> var_296_transpose_x_0 = const()[name = tensor<string, []>("op_296_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_296_transpose_y_0 = const()[name = tensor<string, []>("op_296_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 64]> transpose_251 = transpose(perm = var_290, x = var_289_cast);
            tensor<fp16, [1, 20, 1500, 64]> var_296_cast = matmul(transpose_x = var_296_transpose_x_0, transpose_y = var_296_transpose_y_0, x = var_294_cast, y = transpose_251);
            tensor<int32, [4]> var_297 = const()[name = tensor<string, []>("op_297"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_1 = const()[name = tensor<string, []>("concat_1"), val = tensor<int32, [3]>([1, 1500, 1280])];
            tensor<fp16, [1, 1500, 20, 64]> transpose_248 = transpose(perm = var_297, x = var_296_cast);
            tensor<fp16, [1, 1500, 1280]> x_23_cast = reshape(shape = concat_1, x = transpose_248);
            tensor<fp16, [1280, 1280]> var_302_to_fp16 = const()[name = tensor<string, []>("op_302_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63489920)))];
            tensor<fp16, [1280]> var_303_to_fp16 = const()[name = tensor<string, []>("op_303_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66766784)))];
            tensor<fp16, [1, 1500, 1280]> var_304_cast = linear(bias = var_303_to_fp16, weight = var_302_to_fp16, x = x_23_cast);
            tensor<fp16, [1, 1500, 1280]> x_25_cast = add(x = x_19_cast, y = var_304_cast);
            tensor<int32, [1]> var_310_axes_0 = const()[name = tensor<string, []>("op_310_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_1_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66769408)))];
            tensor<fp16, [1280]> blocks_1_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66772032)))];
            tensor<fp16, [1, 1500, 1280]> var_310_cast = layer_norm(axes = var_310_axes_0, beta = blocks_1_mlp_ln_bias_to_fp16, epsilon = var_235_to_fp16, gamma = blocks_1_mlp_ln_weight_to_fp16, x = x_25_cast);
            tensor<fp16, [5120, 1280]> var_319_to_fp16 = const()[name = tensor<string, []>("op_319_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(66774656)))];
            tensor<fp16, [5120]> var_320_to_fp16 = const()[name = tensor<string, []>("op_320_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79881920)))];
            tensor<fp16, [1, 1500, 5120]> input_17_cast = linear(bias = var_320_to_fp16, weight = var_319_to_fp16, x = var_310_cast);
            tensor<string, []> x_29_mode_0 = const()[name = tensor<string, []>("x_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 5120]> x_29_cast = gelu(mode = x_29_mode_0, x = input_17_cast);
            tensor<fp16, [1280, 5120]> var_325_to_fp16 = const()[name = tensor<string, []>("op_325_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79892224)))];
            tensor<fp16, [1280]> var_326_to_fp16 = const()[name = tensor<string, []>("op_326_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(92999488)))];
            tensor<fp16, [1, 1500, 1280]> var_327_cast = linear(bias = var_326_to_fp16, weight = var_325_to_fp16, x = x_29_cast);
            tensor<fp16, [1, 1500, 1280]> x_31_cast = add(x = x_25_cast, y = var_327_cast);
            tensor<int32, []> var_336 = const()[name = tensor<string, []>("op_336"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_353_axes_0 = const()[name = tensor<string, []>("op_353_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_2_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93002112)))];
            tensor<fp16, [1280]> blocks_2_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_attn_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93004736)))];
            tensor<fp16, []> var_342_to_fp16 = const()[name = tensor<string, []>("op_342_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1280]> var_353_cast = layer_norm(axes = var_353_axes_0, beta = blocks_2_attn_ln_bias_to_fp16, epsilon = var_342_to_fp16, gamma = blocks_2_attn_ln_weight_to_fp16, x = x_31_cast);
            tensor<fp16, [1280, 1280]> var_364_to_fp16 = const()[name = tensor<string, []>("op_364_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93007360)))];
            tensor<fp16, [1280]> var_365_to_fp16 = const()[name = tensor<string, []>("op_365_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96284224)))];
            tensor<fp16, [1, 1500, 1280]> q_9_cast = linear(bias = var_365_to_fp16, weight = var_364_to_fp16, x = var_353_cast);
            tensor<fp16, [1280, 1280]> var_368_to_fp16 = const()[name = tensor<string, []>("op_368_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96286848)))];
            tensor<fp16, [1280]> k_9_bias_0_to_fp16 = const()[name = tensor<string, []>("k_9_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(99563712)))];
            tensor<fp16, [1, 1500, 1280]> k_9_cast = linear(bias = k_9_bias_0_to_fp16, weight = var_368_to_fp16, x = var_353_cast);
            tensor<fp16, [1280, 1280]> var_372_to_fp16 = const()[name = tensor<string, []>("op_372_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(99566336)))];
            tensor<fp16, [1280]> var_373_to_fp16 = const()[name = tensor<string, []>("op_373_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102843200)))];
            tensor<fp16, [1, 1500, 1280]> v_9_cast = linear(bias = var_373_to_fp16, weight = var_372_to_fp16, x = var_353_cast);
            tensor<int32, [4]> var_381 = const()[name = tensor<string, []>("op_381"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_382_cast = reshape(shape = var_381, x = q_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_228_to_fp16 = const()[name = tensor<string, []>("const_228_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> q_11_cast = mul(x = var_382_cast, y = const_228_to_fp16);
            tensor<int32, [4]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_389_cast = reshape(shape = var_388, x = k_9_cast);
            tensor<fp16, [1, 1, 1, 1]> const_229_to_fp16 = const()[name = tensor<string, []>("const_229_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> k_11_cast = mul(x = var_389_cast, y = const_229_to_fp16);
            tensor<int32, [4]> var_395 = const()[name = tensor<string, []>("op_395"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_396_cast = reshape(shape = var_395, x = v_9_cast);
            tensor<int32, [4]> var_397 = const()[name = tensor<string, []>("op_397"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_5_transpose_x_0 = const()[name = tensor<string, []>("qk_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_5_transpose_y_0 = const()[name = tensor<string, []>("qk_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_68_perm_0 = const()[name = tensor<string, []>("transpose_68_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_69_perm_0 = const()[name = tensor<string, []>("transpose_69_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 20, 64, 1500]> transpose_245 = transpose(perm = transpose_69_perm_0, x = k_11_cast);
            tensor<fp16, [1, 20, 1500, 64]> transpose_246 = transpose(perm = transpose_68_perm_0, x = q_11_cast);
            tensor<fp16, [1, 20, 1500, 1500]> qk_5_cast = matmul(transpose_x = qk_5_transpose_x_0, transpose_y = qk_5_transpose_y_0, x = transpose_246, y = transpose_245);
            tensor<fp16, [1, 20, 1500, 1500]> var_401_cast = softmax(axis = var_336, x = qk_5_cast);
            tensor<bool, []> var_403_transpose_x_0 = const()[name = tensor<string, []>("op_403_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_403_transpose_y_0 = const()[name = tensor<string, []>("op_403_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 64]> transpose_247 = transpose(perm = var_397, x = var_396_cast);
            tensor<fp16, [1, 20, 1500, 64]> var_403_cast = matmul(transpose_x = var_403_transpose_x_0, transpose_y = var_403_transpose_y_0, x = var_401_cast, y = transpose_247);
            tensor<int32, [4]> var_404 = const()[name = tensor<string, []>("op_404"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_2 = const()[name = tensor<string, []>("concat_2"), val = tensor<int32, [3]>([1, 1500, 1280])];
            tensor<fp16, [1, 1500, 20, 64]> transpose_244 = transpose(perm = var_404, x = var_403_cast);
            tensor<fp16, [1, 1500, 1280]> x_35_cast = reshape(shape = concat_2, x = transpose_244);
            tensor<fp16, [1280, 1280]> var_409_to_fp16 = const()[name = tensor<string, []>("op_409_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102845824)))];
            tensor<fp16, [1280]> var_410_to_fp16 = const()[name = tensor<string, []>("op_410_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106122688)))];
            tensor<fp16, [1, 1500, 1280]> var_411_cast = linear(bias = var_410_to_fp16, weight = var_409_to_fp16, x = x_35_cast);
            tensor<fp16, [1, 1500, 1280]> x_37_cast = add(x = x_31_cast, y = var_411_cast);
            tensor<int32, [1]> var_417_axes_0 = const()[name = tensor<string, []>("op_417_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_2_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106125312)))];
            tensor<fp16, [1280]> blocks_2_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_2_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106127936)))];
            tensor<fp16, [1, 1500, 1280]> var_417_cast = layer_norm(axes = var_417_axes_0, beta = blocks_2_mlp_ln_bias_to_fp16, epsilon = var_342_to_fp16, gamma = blocks_2_mlp_ln_weight_to_fp16, x = x_37_cast);
            tensor<fp16, [5120, 1280]> var_426_to_fp16 = const()[name = tensor<string, []>("op_426_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106130560)))];
            tensor<fp16, [5120]> var_427_to_fp16 = const()[name = tensor<string, []>("op_427_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119237824)))];
            tensor<fp16, [1, 1500, 5120]> input_25_cast = linear(bias = var_427_to_fp16, weight = var_426_to_fp16, x = var_417_cast);
            tensor<string, []> x_41_mode_0 = const()[name = tensor<string, []>("x_41_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 5120]> x_41_cast = gelu(mode = x_41_mode_0, x = input_25_cast);
            tensor<fp16, [1280, 5120]> var_432_to_fp16 = const()[name = tensor<string, []>("op_432_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119248128)))];
            tensor<fp16, [1280]> var_433_to_fp16 = const()[name = tensor<string, []>("op_433_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132355392)))];
            tensor<fp16, [1, 1500, 1280]> var_434_cast = linear(bias = var_433_to_fp16, weight = var_432_to_fp16, x = x_41_cast);
            tensor<fp16, [1, 1500, 1280]> x_43_cast = add(x = x_37_cast, y = var_434_cast);
            tensor<int32, []> var_443 = const()[name = tensor<string, []>("op_443"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_460_axes_0 = const()[name = tensor<string, []>("op_460_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_3_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132358016)))];
            tensor<fp16, [1280]> blocks_3_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_attn_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132360640)))];
            tensor<fp16, []> var_449_to_fp16 = const()[name = tensor<string, []>("op_449_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1280]> var_460_cast = layer_norm(axes = var_460_axes_0, beta = blocks_3_attn_ln_bias_to_fp16, epsilon = var_449_to_fp16, gamma = blocks_3_attn_ln_weight_to_fp16, x = x_43_cast);
            tensor<fp16, [1280, 1280]> var_471_to_fp16 = const()[name = tensor<string, []>("op_471_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132363264)))];
            tensor<fp16, [1280]> var_472_to_fp16 = const()[name = tensor<string, []>("op_472_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135640128)))];
            tensor<fp16, [1, 1500, 1280]> q_13_cast = linear(bias = var_472_to_fp16, weight = var_471_to_fp16, x = var_460_cast);
            tensor<fp16, [1280, 1280]> var_475_to_fp16 = const()[name = tensor<string, []>("op_475_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135642752)))];
            tensor<fp16, [1280]> k_13_bias_0_to_fp16 = const()[name = tensor<string, []>("k_13_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138919616)))];
            tensor<fp16, [1, 1500, 1280]> k_13_cast = linear(bias = k_13_bias_0_to_fp16, weight = var_475_to_fp16, x = var_460_cast);
            tensor<fp16, [1280, 1280]> var_479_to_fp16 = const()[name = tensor<string, []>("op_479_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138922240)))];
            tensor<fp16, [1280]> var_480_to_fp16 = const()[name = tensor<string, []>("op_480_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142199104)))];
            tensor<fp16, [1, 1500, 1280]> v_13_cast = linear(bias = var_480_to_fp16, weight = var_479_to_fp16, x = var_460_cast);
            tensor<int32, [4]> var_488 = const()[name = tensor<string, []>("op_488"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_489_cast = reshape(shape = var_488, x = q_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_230_to_fp16 = const()[name = tensor<string, []>("const_230_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> q_15_cast = mul(x = var_489_cast, y = const_230_to_fp16);
            tensor<int32, [4]> var_495 = const()[name = tensor<string, []>("op_495"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_496_cast = reshape(shape = var_495, x = k_13_cast);
            tensor<fp16, [1, 1, 1, 1]> const_231_to_fp16 = const()[name = tensor<string, []>("const_231_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> k_15_cast = mul(x = var_496_cast, y = const_231_to_fp16);
            tensor<int32, [4]> var_502 = const()[name = tensor<string, []>("op_502"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_503_cast = reshape(shape = var_502, x = v_13_cast);
            tensor<int32, [4]> var_504 = const()[name = tensor<string, []>("op_504"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_7_transpose_x_0 = const()[name = tensor<string, []>("qk_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_7_transpose_y_0 = const()[name = tensor<string, []>("qk_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_70_perm_0 = const()[name = tensor<string, []>("transpose_70_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_71_perm_0 = const()[name = tensor<string, []>("transpose_71_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 20, 64, 1500]> transpose_241 = transpose(perm = transpose_71_perm_0, x = k_15_cast);
            tensor<fp16, [1, 20, 1500, 64]> transpose_242 = transpose(perm = transpose_70_perm_0, x = q_15_cast);
            tensor<fp16, [1, 20, 1500, 1500]> qk_7_cast = matmul(transpose_x = qk_7_transpose_x_0, transpose_y = qk_7_transpose_y_0, x = transpose_242, y = transpose_241);
            tensor<fp16, [1, 20, 1500, 1500]> var_508_cast = softmax(axis = var_443, x = qk_7_cast);
            tensor<bool, []> var_510_transpose_x_0 = const()[name = tensor<string, []>("op_510_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_510_transpose_y_0 = const()[name = tensor<string, []>("op_510_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 64]> transpose_243 = transpose(perm = var_504, x = var_503_cast);
            tensor<fp16, [1, 20, 1500, 64]> var_510_cast = matmul(transpose_x = var_510_transpose_x_0, transpose_y = var_510_transpose_y_0, x = var_508_cast, y = transpose_243);
            tensor<int32, [4]> var_511 = const()[name = tensor<string, []>("op_511"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_3 = const()[name = tensor<string, []>("concat_3"), val = tensor<int32, [3]>([1, 1500, 1280])];
            tensor<fp16, [1, 1500, 20, 64]> transpose_240 = transpose(perm = var_511, x = var_510_cast);
            tensor<fp16, [1, 1500, 1280]> x_47_cast = reshape(shape = concat_3, x = transpose_240);
            tensor<fp16, [1280, 1280]> var_516_to_fp16 = const()[name = tensor<string, []>("op_516_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142201728)))];
            tensor<fp16, [1280]> var_517_to_fp16 = const()[name = tensor<string, []>("op_517_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145478592)))];
            tensor<fp16, [1, 1500, 1280]> var_518_cast = linear(bias = var_517_to_fp16, weight = var_516_to_fp16, x = x_47_cast);
            tensor<fp16, [1, 1500, 1280]> x_49_cast = add(x = x_43_cast, y = var_518_cast);
            tensor<int32, [1]> var_524_axes_0 = const()[name = tensor<string, []>("op_524_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_3_mlp_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145481216)))];
            tensor<fp16, [1280]> blocks_3_mlp_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_3_mlp_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145483840)))];
            tensor<fp16, [1, 1500, 1280]> var_524_cast = layer_norm(axes = var_524_axes_0, beta = blocks_3_mlp_ln_bias_to_fp16, epsilon = var_449_to_fp16, gamma = blocks_3_mlp_ln_weight_to_fp16, x = x_49_cast);
            tensor<fp16, [5120, 1280]> var_533_to_fp16 = const()[name = tensor<string, []>("op_533_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145486464)))];
            tensor<fp16, [5120]> var_534_to_fp16 = const()[name = tensor<string, []>("op_534_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(158593728)))];
            tensor<fp16, [1, 1500, 5120]> input_33_cast = linear(bias = var_534_to_fp16, weight = var_533_to_fp16, x = var_524_cast);
            tensor<string, []> x_53_mode_0 = const()[name = tensor<string, []>("x_53_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1500, 5120]> x_53_cast = gelu(mode = x_53_mode_0, x = input_33_cast);
            tensor<fp16, [1280, 5120]> var_539_to_fp16 = const()[name = tensor<string, []>("op_539_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(158604032)))];
            tensor<fp16, [1280]> var_540_to_fp16 = const()[name = tensor<string, []>("op_540_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(171711296)))];
            tensor<fp16, [1, 1500, 1280]> var_541_cast = linear(bias = var_540_to_fp16, weight = var_539_to_fp16, x = x_53_cast);
            tensor<fp16, [1, 1500, 1280]> x_55_cast = add(x = x_49_cast, y = var_541_cast);
            tensor<int32, []> var_550 = const()[name = tensor<string, []>("op_550"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_567_axes_0 = const()[name = tensor<string, []>("op_567_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> blocks_4_attn_ln_weight_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(171713920)))];
            tensor<fp16, [1280]> blocks_4_attn_ln_bias_to_fp16 = const()[name = tensor<string, []>("blocks_4_attn_ln_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(171716544)))];
            tensor<fp16, []> var_556_to_fp16 = const()[name = tensor<string, []>("op_556_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1500, 1280]> var_567_cast = layer_norm(axes = var_567_axes_0, beta = blocks_4_attn_ln_bias_to_fp16, epsilon = var_556_to_fp16, gamma = blocks_4_attn_ln_weight_to_fp16, x = x_55_cast);
            tensor<fp16, [1280, 1280]> var_578_to_fp16 = const()[name = tensor<string, []>("op_578_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(171719168)))];
            tensor<fp16, [1280]> var_579_to_fp16 = const()[name = tensor<string, []>("op_579_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(174996032)))];
            tensor<fp16, [1, 1500, 1280]> q_17_cast = linear(bias = var_579_to_fp16, weight = var_578_to_fp16, x = var_567_cast);
            tensor<fp16, [1280, 1280]> var_582_to_fp16 = const()[name = tensor<string, []>("op_582_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(174998656)))];
            tensor<fp16, [1280]> k_17_bias_0_to_fp16 = const()[name = tensor<string, []>("k_17_bias_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178275520)))];
            tensor<fp16, [1, 1500, 1280]> k_17_cast = linear(bias = k_17_bias_0_to_fp16, weight = var_582_to_fp16, x = var_567_cast);
            tensor<fp16, [1280, 1280]> var_586_to_fp16 = const()[name = tensor<string, []>("op_586_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178278144)))];
            tensor<fp16, [1280]> var_587_to_fp16 = const()[name = tensor<string, []>("op_587_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181555008)))];
            tensor<fp16, [1, 1500, 1280]> v_17_cast = linear(bias = var_587_to_fp16, weight = var_586_to_fp16, x = var_567_cast);
            tensor<int32, [4]> var_595 = const()[name = tensor<string, []>("op_595"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_596_cast = reshape(shape = var_595, x = q_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_232_to_fp16 = const()[name = tensor<string, []>("const_232_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> q_19_cast = mul(x = var_596_cast, y = const_232_to_fp16);
            tensor<int32, [4]> var_602 = const()[name = tensor<string, []>("op_602"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_603_cast = reshape(shape = var_602, x = k_17_cast);
            tensor<fp16, [1, 1, 1, 1]> const_233_to_fp16 = const()[name = tensor<string, []>("const_233_to_fp16"), val = tensor<fp16, [1, 1, 1, 1]>([[[[0x1.6ap-2]]]])];
            tensor<fp16, [1, 1500, 20, 64]> k_19_cast = mul(x = var_603_cast, y = const_233_to_fp16);
            tensor<int32, [4]> var_609 = const()[name = tensor<string, []>("op_609"), val = tensor<int32, [4]>([1, 1500, 20, -1])];
            tensor<fp16, [1, 1500, 20, 64]> var_610_cast = reshape(shape = var_609, x = v_17_cast);
            tensor<int32, [4]> var_611 = const()[name = tensor<string, []>("op_611"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<bool, []> qk_9_transpose_x_0 = const()[name = tensor<string, []>("qk_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> qk_9_transpose_y_0 = const()[name = tensor<string, []>("qk_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_72_perm_0 = const()[name = tensor<string, []>("transpose_72_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_73_perm_0 = const()[name = tensor<string, []>("transpose_73_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 20, 64, 1500]> transpose_237 = transpose(perm = transpose_73_perm_0, x = k_19_cast);
            tensor<fp16, [1, 20, 1500, 64]> transpose_238 = transpose(perm = transpose_72_perm_0, x = q_19_cast);
            tensor<fp16, [1, 20, 1500, 1500]> qk_9_cast = matmul(transpose_x = qk_9_transpose_x_0, transpose_y = qk_9_transpose_y_0, x = transpose_238, y = transpose_237);
            tensor<fp16, [1, 20, 1500, 1500]> var_615_cast = softmax(axis = var_550, x = qk_9_cast);
            tensor<bool, []> var_617_transpose_x_0 = const()[name = tensor<string, []>("op_617_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_617_transpose_y_0 = const()[name = tensor<string, []>("op_617_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 64]> transpose_239 = transpose(perm = var_611, x = var_610_cast);
            tensor<fp16, [1, 20, 1500, 64]> var_617_cast = matmul(transpose_x = var_617_transpose_x_0, transpose_y = var_617_transpose_y_0, x = var_615_cast, y = transpose_239);
            tensor<int32, [4]> var_618 = const()[name = tensor<string, []>("op_618"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_4 = const()[name = tensor<string, []>("concat_4"), val = tensor<int32, [3]>([1, 1500, 1280])];
            tensor<fp16, [1, 1500, 20, 64]> transpose_236 = transpose(perm = var_618, x = var_617_cast);
            tensor<fp16, [1, 1500, 1280]> x_59_cast = reshape(shape = concat_4, x = transpose_236);
            tensor<fp16, [1280, 1280]> var_623_to_fp16 = const()[name = tensor<string, []>("op_623_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181557632)))];
